---
kind: property
id: P:Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylApplication
source: html/b1285129-9702-af4b-e56e-f80fa534d39d.htm
---
# Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylApplication Property

The property labeled "Finish" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public static string PlasticvinylApplication { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylApplicationType".